app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "math"], ["room_number", 1234], ["created_at", "2020-11-30 21:54:31.313362"], ["updated_at", "2020-11-30 21:54:31.313362"]]