app/controllers/students_controller.rb

  def create
    @student = Student.create(params.require(:student).permit(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Seth"], ["last_name", "Massarsky"], ["created_at", "2020-11-30 21:53:30.100525"], ["updated_at", "2020-11-30 21:53:30.100525"]]